# How do I select multiple rows and columns from a pandas DataFrame?

In [1]:
import pandas as pd

In [2]:
url = 'http://bit.ly/uforeports'
ufo = pd.read_csv(url)

In [3]:
ufo.head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [7]:
# Using .loc[] to access a group of rows and columns by label => [rows,columns]
ufo.loc[0,:] # 0 is for row 0, : is for all columns

City                       Ithaca
Colors Reported               NaN
Shape Reported           TRIANGLE
State                          NY
Time               6/1/1930 22:00
Name: 0, dtype: object

In [11]:
# Accesing the first 3 rows
# Method 1
ufo.loc[[0,1,2],:] # we pass a list of rows [0,1,2] and : for all columns.

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [12]:
# Accesing the first 3 rows
# Method 2
ufo.loc[0:2,:] # we pass a range without brackets 0:2 for the rows and : for al columns.

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [16]:
# Accessing all the rows and n columns
# Method 1
ufo.loc[:,['City','State']].head() # we pass : for all the rows and a list of columns

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In [17]:
# Accessing all the rows and n range of columns
# Method 2
ufo.loc[:,'City':'State'].head() # we pass : for all the rows and we pass a range without brackets 0:2 for the columns.

                   City Colors Reported Shape Reported State
0                Ithaca             NaN       TRIANGLE    NY
1           Willingboro             NaN          OTHER    NJ
2               Holyoke             NaN           OVAL    CO
3               Abilene             NaN           DISK    KS
4  New York Worlds Fair             NaN          LIGHT    NY